In [1]:
print("Hello World")
print("Merhaba dünya")

Hello World
Merhaba dünya

In [4]:
a=5
a

5

## Pandas

Pandas pythonda veri analiz ve manipülasyonu yapmamızı sağlayan bir kütüphanedir

In [8]:
import pandas as pd

## Pandas Series

Tek boyutlu dizilerdir. (Exceldeki bir sütun)

In [9]:
series1 = pd.Series( [10,20,30,40] )
series1

0    10
1    20
2    30
3    40
dtype: int64

## Pandas DataFrame (Tablo)

Birden fazla sütun içeren tablo. (Excel dosyası)

In [10]:
data = {  "Ad": ["Ali","Ayşe","Mehmet","Zeynep"], "Yaş": [25,30,35,40]   }

In [11]:
df1 = pd.DataFrame(data)
df1

       Ad  Yaş
0     Ali   25
1    Ayşe   30
2  Mehmet   35
3  Zeynep   40

In [12]:
df2 = pd.read_csv("Chocolate Sales.csv")
df2

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

## Pandas kütüphanesinde 10 adet fonksiyon araştırılıp kullanım örneği olan bir ipynb dosyası ile paylaşılacak.

## Veri Ön Hazırlığı